Repository: Mis0u/let-me-train
Catalog: translations/validators/validators.*.xlf
Languages: fr

# user.email.not_blank
source: Email can't be blank
fr: L'email ne peut être vide

# user.email.format
source: This email format is invalid
fr: Ce format d'email est invalide

# user.unique.email
source: This email is already used
fr: Cet email est déjà utilisé

# user.gender.choice
source: This choice is not on the list :)
fr: Ce choix ne fais pas partie de la liste :)

# user.unique.alias
source: This username is already used
fr: Ce pseudo est déjà utilisé

# user.alias.not_blank
source: You must enter a nickname
fr: Tu dois renseigner un pseudo

# user.alias.min_length
source: Your username must be at least {{ limit }} characters long
fr: Ton pseudo doit faire au minimum {{ limit }} caractères

# user.alias.max_length
source: Your username must be a maximum of {{ limit }} characters
fr: Ton pseudo doit faire au maximum {{ limit }} caractères

# user.password.repeatedType
source: Your passwords should be the same
fr: Les mots de passe doivent être identique

# user.password.not_blank
source: Your passwords should be filled
fr: Les mots de passe doivent être rempli

# user.password.min_length
source: Your password must be at least {{ limit }} characters long
fr: Le mot de passe doit faire au minimum {{ limit }} caractères

# user.password.alias_email
source: Your password can't be the same than your username or email
fr: Ton mot de passe ne peut être identique à ton email ou ton pseudo

# user.password.regex
source: Your password must be at least 1 uppercase, 1 lowercase and 1 digit
fr: Ton mot de passe doit avoir au minimum 1 majuscule, 1 minuscule et 1 chiffre
